{
  "projects": [
    {
      "companyId": "SP",
      "id": "quizzingcousins",
      "period": {
        "start": {
          "year": 2022,
          "month": 4
        },
        "end": null
      },
      "dk": {
        "project": "Quizzing Cousins website",
        "description": "Quiz website (https://quizzingcousins.com) bygget på data fra wikidata.org. Sitet er en React/TypeScript frontend med en ASP.NET Core backend. Databasen er en Sqlite.  \nData hentes som JSON, filtreres og importeres ind i en lokal Neo4j, hvorfra der med Cypher kan udtrækkes data til spørgsmål."
      },
      "en": {
        "project": "Quizzing Cousins website",
        "description": "Quiz website (https://quizzingcousins.com) built on data from wikidata.org. The site is a React/TypeScript front with an ASP.NET Core backend. The database is SQLite.  \nData is downloaded as JSON, filtered and imported into Neo4j, from where Cypher is used for selecting data for questions."
      },
      "technologies": [
        "vs",
        "vscode",
        "reactts",
        "typescript",
        "aspnetcore",
        "neo4j",
        "cypher",
        "sqlite"
      ]
    },
    {
      "companyId": "SP",
      "id": "mrlegacy",
      "period": {
        "start": {
          "year": 2022,
          "month": 3
        },
        "end": null
      },
      "dk": {
        "project": "Mr. Legacy web site",
        "description": "CV og blog-site udviklet med React og TypeScript: https://mrlegacy.dk"
      },
      "en": {
        "project": "Mr. Legacy web site",
        "description": "CV and blog-site developed with React and TypeScript for e.g. researching organizing code in front end applications: https://www.mrlegacy.dk"
      },
      "technologies": [
        "vscode",
        "reactts",
        "typescript"
      ]
    },
    {
      "companyId": "IDA",
      "id": "ODatanuget",
      "period": {
        "start": {
          "year": 2021,
          "month": 8
        },
        "end": {
          "year": 2021,
          "month": 9
        }
      },
      "dk": {
        "project": "OData nuget pakke",
        "description": "Erfaringer høstet i IDA med brug af OData som adgangslag til CRM blev implementeret i en nuget pakke, som kan bruges af andre applikationer og gør det at bruge OData ganske let."
      },
      "en": {
        "project": "OData nuget package",
        "description": "Experience drawn from using OData as access layer for CRM was implemented in a nuget package, thereby making OData easily usable in other applications.  \n\nArchitecture, nconfiguration, test."
      },
      "technologies": [
        "vs",
        "netstandard2",
        "nuget",
        "odata"
      ]
    },
    {
      "companyId": "IDA",
      "id": "Arrangementsoprettelse",
      "period": {
        "start": {
          "year": 2020,
          "month": 9
        },
        "end": {
          "year": 2021,
          "month": 5
        }
      },
      "dk": {
        "project": "Arrangementsoprettelse",
        "description": "Team Spirit re-implementerede et tidligere Drupal website (som var end-of-life), som IDAs aktive/parlamentarikere bruger til oprettelse af arrangementer. Dette nye website blev udviklet på IDAs SOA platform."
      },
      "en": {
        "project": "Meetup create",
        "description": "The agile Team Spirit re-implemented a former Drupal site (which was end-of-life) used by IDA’s parlimentarians for creating meetups. This new site was developed on IDA’s SOA platform using .NET Core and React/TypeScript  \n\nArchitecture - e.g. DDD and REST principles.  \n\nFront end tasks with components based on IDA’s Design System."
      },
      "technologies": [
        "vs",
        "aspnetcore",
        "netcore3",
        "rest",
        "wcf",
        "nsb",
        "reactts",
        "odata",
        "docker",
        "kubernetes",
        "ddd"
      ]
    },
    {
      "companyId": "IDA",
      "id": "tis",
      "period": {
        "start": {
          "year": 2019,
          "month": 11
        },
        "end": {
          "year": 2020,
          "month": 3
        }
      },
      "dk": {
        "project": "Teamshare Integration Service",
        "description": "Sammen med to IDA kollegaer og “The Architect” implementeredes et API-lag og tilhørende nuget-pakke for at abstrahere adgang til IDAs Teamshare installation (som vitterligt er en pine i bagen at udvikle op imod)"
      },
      "en": {
        "project": "Teamshare Integration Service",
        "description": "With two IDA colleagues and IDA's “The Architect” an api-layer and corresponding nuget-package was implemented for abstracting the programmaticaccess to IDAs Teamshare installation (which is a pain to develop against)  \n\nArchitecture  \nTest – unit test and integration test"
      },
      "technologies": [
        "vs",
        "ts",
        "aspnet",
        "net48",
        "wcf",
        "nuget",
        "net",
        "nservicebus",
        "octopus",
        "teamcity",
        "rest"
      ]
    },
    {
      "companyId": "IDA",
      "id": "tillidssite",
      "period": {
        "start": {
          "year": 2019,
          "month": 2
        },
        "end": {
          "year": 2019,
          "month": 6
        }
      },
      "dk": {
        "project": "Tillidshvervsanmeldelse website",
        "description": "Som den første faktiske applikation på dels IDAs SOA-platform og dels IDAs Design System implementeredes et nyt website med ASP.NET Core backend og frontend i ReactTS"
      },
      "en": {
        "project": "Website for registration of position of trust",
        "description": "As the first real application on IDA's SOA platform and to some extent IDA's Design System a website was implemented using ASP.NET Core for the back end and React/TypeScript for the front end.  \n\nArchitecture  \nTest"
      },
      "technologies": [
        "vs",
        "aspnetcore",
        "netcore21",
        "wcf",
        "rest",
        "reactts",
        "docker",
        "kubernetes",
        "typescript"
      ]
    },
    {
      "companyId": "IDA",
      "id": "mitida",
      "period": {
        "start": {
          "year": 2016,
          "month": 3
        },
        "end": {
          "year": 2016,
          "month": 11
        }
      },
      "dk": {
        "project": "Mit Ida website",
        "description": "Sammen med en anden konsulent byggedes et Umbraco-website til Mit Ida (https://mitida.dk), som var en migrering og opdatering af et eksisterende website (service.ida.dk)."
      },
      "en": {
        "project": "Mit Ida website (My Ida website)",
        "description": "Together with another external consultant we built an Umbraco website for Mit Ida ( https:// mit.ida .dk), as a migration and update of an existing website (service.ida.dk – no longer in service)"
      },
      "technologies": [
        "vs15",
        "umbraco",
        "css",
        "js",
        "angularjs",
        "octopus",
        "teamcity"
      ]
    },
    {
      "companyId": "IDA",
      "id": "idacrm",
      "period": {
        "start": {
          "year": 2015,
          "month": 12
        },
        "end": {
          "year": 2021,
          "month": 12
        }
      },
      "dk": {
        "project": "IDA Crm - Microsoft Dynamics CRM",
        "description": "Sammen med forskellige eksterne konsulenter lavedes vedligehold, opgraderinger og viderudvikling på IDAs CRM installation."
      },
      "en": {
        "project": "IDA Crm - Microsoft Dynamics CRM",
        "description": "Doing maintenance, upgrades and development of new features on IDA's CRM installation together with various external consultants"
      },
      "technologies": [
        "vs",
        "crm",
        "net",
        "octopus",
        "teamcity"
      ]
    },
    {
      "companyId": "IDA",
      "id": "idaforsikring",
      "period": {
        "start": {
          "year": 2015,
          "month": 9
        },
        "end": {
          "year": 2016,
          "month": 2
        }
      },
      "dk": {
        "project": "IDA Forsikring website",
        "description": "Sammen med en anden ekstern konsulent byggedes et Umbraco-website til IDA forsikring (https://idaforsikring.dk).  \nKonvertering af CSS fra tidligere idaforsikring.dk.  \nImplementation af url alias og redirect-system."
      },
      "en": {
        "project": "IDA Forsikring website (Website for IDA Insurance)",
        "description": "Together with another external consultant we built an Umbraco-website for IDA Forsikring (https://idaforsikring.dk).  \n\nConversion of CSS from a former idaforsikring.dk.  \nImplementation of url alias and redirect-system."
      },
      "technologies": [
        "vs15",
        "umbraco",
        "net",
        "css",
        "angularjs",
        "octopus",
        "teamcity"
      ]
    },
    {
      "companyId": "IDA",
      "id": "idalogging",
      "period": {
        "start": {
          "year": 2014,
          "month": 10
        },
        "end": {
          "year": 2014,
          "month": 12
        }
      },
      "dk": {
        "project": "IDA Logging",
        "description": "Design og implementation af generisk application logging system. Der blev bygget en AngularJS frontend, en ASP.NET backend op mod en SQL Server. Endvidere en nuget-pakke til nem installation i diverse applikationer. Et generisk logging-framework (SoftwarePassion.LogBridge - https://github.com/TorbenRahbekKoch/LogBridge) bruges som Logging-api."
      },
      "en": {
        "project": "IDA Logging",
        "description": "Design and implementation of a generic logging system. An AngularJS front end, an ASP.NET back end using SQL Server for storage. A nuget-package for easy installation in other applications.  \n\nDatabase design\nA generic logging-framework (SoftwarePassion.LogBridge - https://github.com/TorbenRahbekKoch/LogBridge) was used as Logging-api."
      },
      "technologies": [
        "vs13",
        "mssql2008",
        "tsql",
        "net45",
        "webapi2",
        "aspnet",
        "rest",
        "ef",
        "angularjs",
        "odata",
        "octopus",
        "teamcity"
      ]
    },
    {
      "companyId": "IDA",
      "id": "teamcity",
      "period": {
        "start": {
          "year": 2014,
          "month": 10
        },
        "end": {
          "year": 2021,
          "month": 12
        }
      },
      "dk": {
        "project": "TeamCity",
        "description": "Løbende vedligehold og opbygning af build configuration templates. Sammen med IDAs “The architect” blev der løbende opbygget nye templates, der passede til de forskellige behov, som forskellige grupper af applikationer har. Sammen med driften lavedes løbende opdateringer af selve TeamCity-build-serveren."
      },
      "en": {
        "project": "TeamCity",
        "description": "Maintenance of TeamCity, building new build configurations and templates. Together with IDA’s “The Architect” we built templates fitting the various and shifting needs, the diverse groups of applications have.  \nUpgrading TeamCity together with Operations."
      },
      "technologies": [
        "teamcity"
      ]
    },
    {
      "companyId": "IDA",
      "id": "idadiverse",
      "period": {
        "start": {
          "year": 2014,
          "month": 5
        },
        "end": {
          "year": 2021,
          "month": 12
        }
      },
      "dk": {
        "project": "Diverse",
        "description": "Opdatering og vedligehold af diverse eksisterende og nye applikationer, en blandet landhandel, eksempelvis: batch jobs, Windows services, websites og web services, word templates. En del “find koden”-arbejde (det var ikke altid klart, hvor koden var), løbendeopdatering til nyere .NET Frameworks, oprydning/refaktorering, samarbejde med drift om deploy, snak med forretning om “hvad det nu lige er den applikation laver”.  \n\nDet var primært disse opgaver, der gav mig tilnavnet *Mr. Legacy*."
      },
      "en": {
        "project": "Various tasks",
        "description": "Updating and maintenance of various existing and new applications, a mixed bag of batch jobs, Windows services, websites and web services, word templates and what have you.  \nA lot of “Find the code” and similar archeological digs.   \nUpgrading to newer .NET Frameworks.  \nClean up/refactoring  \nWorking with Operations when deploying  \nTalks with business about “what does this application do”  \nMoving repositories from Subversion to Bonobo Git  \nMoving repositories from Bonobo Git to Azure DevOps."
      },
      "technologies": [
        "vs",
        "mssql",
        "net",
        "webapi",
        "aspnet",
        "asp",
        "wcf",
        "angularjs",
        "reactjs",
        "reactts",
        "js",
        "typescript",
        "subversion",
        "git",
        "octopus"
      ]
    },
    {
      "companyId": "KMD",
      "id": "workflowengine",
      "period": {
        "start": {
          "year": 2012,
          "month": 3
        },
        "end": {
          "year": 2013,
          "month": 4
        }
      },
      "dk": {
        "project": "Workflow Engine",
        "description": "I samarbejde med flere interne udviklere og eksterne konsulenter designes og implementeres et system til at afvikle workflows baseret på forskellige eksterne hændelser."
      },
      "en": {
        "project": "Workflow Engine",
        "description": "In cooperation with more internal and external developers a generic system to run Workflow Foundation workflows when different external events happen.  \nAn editor for workflows was built using WPF"
      },
      "technologies": [
        "vs10",
        "vs12",
        "mssql2008r2",
        "net4",
        "net45",
        "wcf",
        "wpf",
        "wf"
      ]
    },
    {
      "companyId": "KMD",
      "id": "servicelayer",
      "period": {
        "start": {
          "year": 2013,
          "month": 8
        },
        "end": {
          "year": 2013,
          "month": 12
        }
      },
      "dk": {
        "project": "Servicelayer",
        "description": "I samarbejde med flere interne udviklere designes og implementeres et servicelag til at abstrahere flere meget forskellige underliggende systemer til et mere generisk og sammenhængende REST interface"
      },
      "en": {
        "project": "Service layer",
        "description": "A service layer abstracting several (vastly) different systems into a more generic and coherent REST interface"
      },
      "technologies": [
        "vs12",
        "mssql2008r2",
        "net45",
        "rest",
        "webapi",
        "odata"
      ]
    },
    {
      "companyId": "COOK",
      "id": "phoenix",
      "period": {
        "start": {
          "year": 2010,
          "month": 3
        },
        "end": {
          "year": 2012,
          "month": 2
        }
      },
      "dk": {
        "project": "Phoenix",
        "description": "Et nyt passenger management system til håndtering af bookinger fra turoperatører (charterselskaber)I samarbejde med 4 andre konsulenter og 3 interne medarbejdere udviklere designes og bygges Phoenix over to år. Systemet indeholder et væld af integrationspunkter til andre systemer. Det erstatter et eksisterende system (Pegasus) med et tidsvarende og opgavesvarende UI. Der er tale om et traditionelt client/serversystem. Personligt stod jeg blandt andet for udlæsning af PNL’er (Passenger Name Lists), som sendes til check-in-skranker rundt omkring i verden"
      },
      "en": {
        "project": "Phoenix",
        "description": "A new passenger management system for handling bookings from tour operators.  \nIn cooperation with 4 other independents and three of Thomas Cook's own employees Phoenix is designed and developed over two years. The system contains integrations to many other systems and replaces an existing system (Pegasus) with a contemporary UI (built in WPF), which directly supports the tasks of the employees. Phoenix is built as a traditional client/server system.  \n\nAmongst many tasks I personally handled the PNLs (Passenger Name Lists) which are sent to check-in-desks all over the world"
      },
      "technologies": [
        "vs10",
        "mssql2008",
        "net4",
        "wcf",
        "wpf",
        "wf",
        "msmq"
      ]
    },
    {
      "companyId": "COOK",
      "id": "configurationmanager",
      "period": {
        "start": {
          "year": 2010,
          "month": 3
        },
        "end": {
          "year": 2012,
          "month": 2
        }
      },
      "dk": {
        "project": "Configuration Manager",
        "description": "Centralt konfigureringssystem til at lette byrden med at styre konfigurationer i udvikling, test og produktion. Klientprogrammer forbinder sig til Configuration Manager for at få at vide, hvor eksempelvis databaser og services befinder sig. Environment styres fra configfil eller kommandolinje."
      },
      "en": {
        "project": "Configuration Manager",
        "description": "A central configuration system to ease the burden with handling configuration in development, test and production.  \nClients connect to Configuration Manager to get infomation on whereabouts of e.g. databases and services. The environment was controlled via configuration files or command line"
      },
      "technologies": [
        "vs10",
        "mssql2008",
        "net4",
        "wcf",
        "wpf"
      ]
    },
    {
      "companyId": "COOK",
      "id": "wfmmanager",
      "period": {
        "start": {
          "year": 2010,
          "month": 3
        },
        "end": {
          "year": 2012,
          "month": 2
        }
      },
      "dk": {
        "project": "WFM Workflow Manager",
        "description": "Et batchhåndteringssystem baseret på Workflow Foundation. Workflow Manager bruges til at specificere batchjobs som workflows i stedet for eksempelvis Powershell"
      },
      "en": {
        "project": "WFM Workflow Manager",
        "description": "A batch handling system based on Workflow Foundation. Used for specifying batch jobs as workflows instead of e.g. Powershell"
      },
      "technologies": [
        "vs10",
        "mssql2008",
        "net4",
        "wcf",
        "wpf",
        "wf",
        "msmq"
      ]
    },
    {
      "companyId": "GK",
      "id": "ansættelsesbreve",
      "period": {
        "start": {
          "year": 2009,
          "month": 3
        },
        "end": {
          "year": 2009,
          "month": 5
        }
      },
      "dk": {
        "project": "Ansættelsesbreve",
        "description": "Et frasebaseret websystem til generering af ansættelsesbreve. Centralt oprettes fraser og kombinationer af disse knyttes til bestemte stillinger. Herefter kan decentralt fra udvælges en stilling, indtastes navn, adresse osv, hvorefter ansættelsesbrevet genereres og sendes til brugeren via mail."
      },
      "en": {
        "project": "Letters of employment",
        "description": "A phrase based system for generating letters of employment. Centrally phrases are entered and combinations of these are connected to specific positions. The letters can then be generated decentrally simply by entering name, address etc. ofthe new employee and choosing a specific position. The letters are mailed to the user."
      },
      "technologies": [
        "vs08",
        "mssql2005",
        "smartclient",
        "fckeditor",
        "asposewords"
      ]
    },
    {
      "companyId": "EF",
      "id": "easyplan",
      "period": {
        "start": {
          "year": 2008,
          "month": 12
        },
        "end": {
          "year": 2009,
          "month": 10
        }
      },
      "dk": {
        "project": "EasyPlan",
        "description": "Tilret og fejlret C++ applikation til brug for vagtplanlægning.  \nPåbegyndte en længerevarende ”opretning” af applikationen, så den opnår databaseuafhængighed og lettere kan opfylde sine fremtidige opgaver. Projektet blev afsluttet da vi desværre løb tør for tid."
      },
      "en": {
        "project": "EasyPlan",
        "description": "Analyze and modify a C++ application used for creating roosters for work shifts. Started a thorough update of the application to achieve database independency, and make it possible to grow to meet future demands. The project was ended when we ran out of time"
      },
      "technologies": [
        "c++builder2006",
        "xml",
        "xsl",
        "mssql2005",
        "subversion"
      ]
    },
    {
      "companyId": "PD",
      "id": "trs",
      "period": {
        "start": {
          "year": 2007,
          "month": 12
        },
        "end": {
          "year": 2008,
          "month": 10
        }
      },
      "dk": {
        "project": "TRS (Telefoniregistreringssystem)",
        "description": "Byg en web-applikation til vedligeholdelse af koncernbetalte mobil- og privatabonnementer.  \nStore dele af analysen og design af databasen var gjort, da jeg kom ind i projektet. Min første opgave blev at lave et Data Access Lag, som blev kraftigt inspireret af LINQ (som vi grundet begrænsninger i produktionen ikke kunne anvende på daværende tidspunkt). Senere i forløbet påbegyndtes en migrering til LINQ.  \nUdover DAL bestod mine opgaver af at lave grænseflader til migrering af data fra eksisterende systemer. Herunder en MSSQL database med eksisterende abonnementer, medarbejderdata og organisationsdata fra SAP, samt en nogle excel og tekstfiler.  \nProjektet gjorde sig store anstrengelser for at holde logik væk fra GUI-laget (code-behind-filerne) og bruger i stor grad unit tests.  \nJeg stod i samarbejde med testerne for en stor del af slutbrugerundervisning."
      },
      "en": {
        "project": "TRS - Telefoniregistreringssystem (Phone subscription registration system). ",
        "description": "Build a web-application for maintaining company-paid mobile and private phone subscriptions.  \nMajor parts of the analysis and design were done, when I entered the project. My first task was to create a Data Access Layer, which came out very much inspired by LINQ (which was not available to use because of limitations in the production environment). Later in the project a migration to LINQ was started.  \nBesides creating the DAL my tasks consisted of creating interfaces to existing systems, like an MS SQL database with existing subscriptions, and employee andorganizational data from SAP. Furthermore we needed to import excel and text files. \nThe project made great strides in keeping logic away from the UI-layer (code behind) and had a wide use of unit tests.  \nI was in coorporation with the testers responsible for education of end users."
      },
      "technologies": [
        "c++builder2006",
        "xml",
        "xsl",
        "mssql2005",
        "subversion"
      ]
    },
    {
      "companyId": "EFS",
      "id": "lasernet",
      "period": {
        "start": {
          "year": 2002,
          "month": 1
        },
        "end": {
          "year": 2007,
          "month": 9
        }
      },
      "dk": {
        "project": "LaserNet v6",
        "description": "Design og implementer en ny, teknologisk tidssvarende version af output management systemet LaserNet 5. Den gamle version kunne kun generere PCL og arbejdede med PCL internt. Den nye version skal benytte et mere gængs format - EMF (Windows Enhanced Metafile) lignende.  \nalget faldt på at implementere i C++. LaserNet v6 er opbygget modulært, benytter sig af egenudviklede printer drivers, print processors og print monitors, der gør det muligt at arbejde med både Windows EMF og en modificeret udgave tilpasset egne formål.  \nDer kan ombrydes både tekst og XML. Der kan skrives ud til printer og fax, lagres i fil og database, sendes via email, ftp og http.  \nData tages ind via printer driver (Windows Spool System), fil, database, ftp, http. Der kan laves XML (f.eks. UBL/OIOXML) transformeringer ved hjælp af XPath, XSLT og DOM. Der kan produceres tekst til f.eks. print eller PDF. Der understøttes avanceret filtrering ved hjælp af regulære udtryk.  \nI september 2007 bestod LaserNet v6 af 400.000 linjer C++ kode."
      },
      "en": {
        "project": "LaserNet v6",
        "description": "Design and implement a new, technologically current version of the output management system LaserNet 5. The old version generated PCL as well as used it internally. The new version uses EMF (Windows Enhanced Metafile).  \nLaserNet v6 was implemented in C++ with a modular architecture and plugin ready. It uses its own printer drivers, print processors and print monitors, making it possible to work with both Windows EMF and modified version adapted to LaserNet v6.  \nLaserNet v6 works with both text and XML. It writes to printers, faxes, stores in files and databases, sends to email, ftp, http.  \nData enters via printer driver (Windows Spool subsystem), file, database, ftp, http.  \nXML transformations (e.g. UBL/OIOXL) are supported using Xpath, XSLT and DOM. Text for print and PDF is produced. Advanced filtering using regular expressions are supported. \n\nIn september 2007 LaserNet v6 consisted of about 400.000 lines of C++ code."
      },
      "technologies": [
        "c++",
        "com",
        "activex",
        "odbc",
        "xml",
        "xpath",
        "xslt",
        "dom",
        "ws",
        "mapi",
        "soap",
        "windowsnt",
        "windows2000",
        "windowsxp",
        "windowsvista",
        "visualc++6",
        "visualc++2003",
        "visualc++2005",
        "qt",
        "qsa"
      ]
    },
    {
      "companyId": "EFS",
      "id": "buildsystem",
      "period": {
        "start": {
          "year": 2004,
          "month": 1
        },
        "end": {
          "year": 2007,
          "month": 9
        }
      },
      "dk": {
        "project": "Build system og issue tracking",
        "description": "Opbygning af et system til styring af builds af forskellige produkter og versioner af disse.  \nFastlægning af strategier for brug af Fogbugz (issue tracking) og Subversion.  \nAutomatisk vedligeholdelse af symbol database.  \nEn web-frontend (C#, IIS) op mod SQL Server 2000.  \nFørste udgave var med Visual Build, som blev afviklet af serveren.  \nI anden udgave bliver builds foretaget af LaserNet v6 som \"mellemmand\" i forhold til database, Visual Studio, Setup Factory og SymStore.  \nBuild-steps bliver fastlagt af en xml-fil, som LaserNet v6 parser og reagerer på."
      },
      "en": {
        "project": "Build system and issue tracking",
        "description": "Building a build system.  \nStrategies for using Fogbugz (issue tracking) and Subversion.  \nAutomatically maintenance of a symbol database.  \nA web front end (C#/IIS) against SQL Server 200. \nThe first edition was with Visual Build.  \nIn the second edition builds was done by LaserNet v6 as the ”middle man” regarding database, Visual Studio, Setup Factory and Symstore.  \nBuilds are described using and xml-file, which LaserNet v6 parses and reacts upon"
      },
      "technologies": [
        "windows2003",
        "mssql",
        "c#",
        "j#",
        "aspnet",
        "xml",
        "fogbugz",
        "subversion",
        "visualbuild",
        "lasernetv6",
        "setupfactory",
        "symstore"
      ]
    },
    {
      "companyId": "XP",
      "id": "loyalty",
      "period": {
        "start": {
          "year": 2001,
          "month": 1
        },
        "end": {
          "year": 2001,
          "month": 12
        }
      },
      "dk": {
        "project": "Loyalitetskort",
        "description": "Opbygning af et system til ind- og udlæsning af plastickortdata (loyalitetskort) til Oracle database.  \nSystemet blev implementeret i Borland Delphi 6. Til at beskrive formatet af inputdata brugtes bla. Regular expressions."
      },
      "en": {
        "project": "Loyalty cards",
        "description": "Building a system for reading and writing smart card data to an Oracle database.  \nThe system was implemented in Borland Delphi 6. Describing the format of input data was done e.g using regular expressions. "
      },
      "technologies": [
        "windows2000",
        "delphi6",
        "wsh",
        "oracle"
      ]
    },
    {
      "companyId": "GRAPH",
      "id": "gsm",
      "period": {
        "start": {
          "year": 2000,
          "month": 2
        },
        "end": {
          "year": 2001,
          "month": 8
        }
      },
      "dk": {
        "project": "GSM Data Generator",
        "description": "Stadigt den samme GSM Data Generator.  \nVedligeholdelse af produktionssoftware til generering af data til SIMkort.  \nDesign og implementation af diverse databehandlende dele af programmet.  \nAdministration og programmering af SQL Server 7.0.  \nForskellige NT administrationsopgaver."
      },
      "en": {
        "project": "GSM Data Generator",
        "description": "Still the same GSM Data Generator ;)  \nMaintaining production software for a SIM-card manufacturer (Graphium, now XponCard).  \nDesign and implementation of various data computing parts of the system.  \nAdministration and programming of SQL Server 7.0  \nVarious NT administrative tasks."
      },
      "technologies": [
        "delphi4",
        "delphi5",
        "mssql7"
      ]
    },
    {
      "companyId": "GRAPH",
      "id": "lasernet2",
      "period": {
        "start": {
          "year": 2000,
          "month": 2
        },
        "end": {
          "year": 2001,
          "month": 8
        }
      },
      "dk": {
        "project": "LaserNet 5",
        "description": "Et system til styring af elektroniske blanketter og formularer.  \nFunktionalitetsudvidelse og fejlretning."
      },
      "en": {
        "project": "LaserNet 5",
        "description": "Main programmer on LaserNet, a product used for document output management.  \nAdding scripting capabilities   \nFunktionalitetsudvidelse og debugging."
      },
      "technologies": [
        "delphi4",
        "delphi5",
        "pcl"
      ]
    },
    {
      "companyId": "DC",
      "id": "gsm4",
      "period": {
        "start": {
          "year": 2000,
          "month": 2
        },
        "end": {
          "year": 2001,
          "month": 8
        }
      },
      "dk": {
        "project": "GSM Data Generator",
        "description": "Vedligeholdelse af produktionssoftware til generering af data til SIMkort.  \nDesign og implementation af diverse databehandlende dele af programmet.  \nAdministration og programmering af SQL Server 7.0.  \nForskellige NT administrationsopgaver."
      },
      "en": {
        "project": "GSM Data  Generator",
        "description": "Maintaining production software for a SIM-card manufacturer (Graphium, now XponCard). Design and implementation of various data computing parts of the system.  \nAdministration and programming of SQL Server 7.0  \nVarious NT administrative tasks"
      },
      "technologies": [
        "delphi4",
        "delphi5",
        "mssql7"
      ]
    },
    {
      "companyId": "OLICOM",
      "id": "pin",
      "period": {
        "start": {
          "year": 1997,
          "month": 8
        },
        "end": {
          "year": 1999,
          "month": 2
        }
      },
      "dk": {
        "project": "PIN",
        "description": "PIN = Product Information Network. En fejlsporingsdatabase til netværksudstyr og drivere.  \nFlet to eksisterende fejlsporingssystemer. Det ene implementeret i MS Access og det andet i PowerBuilder med en Sybase database bag ved.  \nDet nye system blev implementeret som en web-applikation i MS Internet Explorer 4.0, DHTML og ASP på IIS 4.0."
      },
      "en": {
        "project": "Bug tracking database - PIN (Product Information Network)",
        "description": "Merging two existing bug tracking systems. One implemented in MS Access and the other in PowerBuilder using a Sybase database. The new system was implemented as a web application in MS IE 4.0 using DHTML and ASP on IIS 4.0."
      },
      "technologies": [
        "dhtml",
        "rds",
        "asp",
        "mssql65"
      ]
    },
    {
      "companyId": "BOSTIK",
      "id": "kunde",
      "period": {
        "start": {
          "year": 1993,
          "month": 3
        },
        "end": {
          "year": 1997,
          "month": 8
        }
      },
      "dk": {
        "project": "Kundestyringssystem for laptops",
        "description": "Et datasynkroniseringsprogram til at synkronisere data mellem bærbare computere og firmaets AS/400 computer (Delphi 1.0).  \nDefinition og dokumentation af brugerkrav.  \nAnalyse og design i samarbejde med brugere.  \nProgram udvikling. Test."
      },
      "en": {
        "project": "Customer management system for laptops",
        "description": "A order and customer management system with synchronization between the laptops and the company's AS/400 computer.  \nThe laptop UI (and database) was build using MS Access 2.0.  \nThe synchronization system using Delphi 1.0.  \n\nDefinition and documentation of user requirements.  \nAnalysis and design in coorporation with users.  \nDevelopment.  \nTest"
      },
      "technologies": [
        "msaccess2",
        "delphi1"
      ]
    },
    {
      "companyId": "FW",
      "id": "eventyrsjov",
      "period": {
        "start": {
          "year": 1994,
          "month": 7
        },
        "end": {
          "year": 1995,
          "month": 6
        }
      },
      "dk": {
        "project": "Eventyrsjov",
        "description": "En editor til at lave og spille \"eventyrspil\" i stil med Sværd & Trolddom-bøgerne. Blev brugt i undervisningen i Ungdomsskolen." 
      },
      "en": {
        "project": "Eventyrsjov (Adventure fun)",
        "description": "An editor for creating and playing role playing games like the Fighting Fantasy books. I used the editor when teaching in the youth school."
      },
      "technologies": [
        "borlandpascal",
        "turbovision"
      ]
    }
  ]
}